import numpy as np

# =================================================================
# --- 1. Параметры Симуляции ---
# =================================================================
GUI_MODE = True           # Будет переключаться в train.py
SIM_TIMESTEP = 1.0 / 240.0
ACTION_REPEAT = 15        # Повторяем действие 15 раз для плавности
MAX_EPISODE_STEPS = 100   # Лимит шагов (с учетом повторений это много)

# =================================================================
# --- 2. Параметры Среды ---
# =================================================================
PLANE_URDF_PATH = "plane.urdf"
ROBOT_URDF_PATH = "husky/husky.urdf"

# Параметры Husky
MAX_WHEEL_FORCE = 80      # Сила моторов
MAX_TARGET_SPAWN_RADIUS = 2.0 # Радиус появления цели

# =================================================================
# --- 3. Параметры Действий ---
# =================================================================
BASE_SPEED = 12.0 
TURN_SPEED = 6.0 

ACTIONS_MAP = {
    0: (BASE_SPEED, BASE_SPEED),     # Вперед
    1: (-BASE_SPEED, -BASE_SPEED),   # Назад
    2: (-TURN_SPEED, TURN_SPEED),    # Влево 
    3: (TURN_SPEED, -TURN_SPEED),    # Вправо 
    4: (0, 0)                        # Стоп
}
NUM_ACTIONS = len(ACTIONS_MAP)

# =================================================================
# --- 4. Параметры Состояния (Q-Table) ---
# =================================================================
NUM_DISTANCE_BINS = 10
NUM_ANGLE_BINS = 10
MAX_STATE_DISTANCE = MAX_TARGET_SPAWN_RADIUS * 1.5
MAX_STATE_ANGLE = np.pi 

# =================================================================
# --- 5. Параметры Обучения (Q-Learning) ---
# =================================================================
NUM_EPISODES = 1000      
ALPHA = 0.2              
GAMMA = 0.99             

EPSILON_START = 1.0      
EPSILON_END = 0.01       
EPSILON_DECAY_DURATION = NUM_EPISODES * 0.8

# =================================================================
# --- 6. Параметры Награды ---
# =================================================================
REACH_GOAL_BONUS = 100.0   # Главный приз
DISTANCE_THRESHOLD = 0.55  # Радиус победы (учитывая размер Husky)

TURN_PENALTY_FACTOR = 0.2  # Штраф за повороты
IDLE_PENALTY = 0.5         # Штраф за простой (действие 4)
STEP_PENALTY = 0.0         # Штраф за время (отключен)